# თქვენი სიტყვებით ახსენით რა მსგავსებები და განსხვავებები არის Tuple'ბს და list'ებს შორის

#  list შეცვლა შეგვიძლია tuple სი არა
# listhi შეგვიძ₾ია გამოვიყენთ pop append  და ა.შ
# tuple შეცვლა არ შეგვიძლია ის როცა შეიქმნება  მას ვეღარ შეცვლი თუ ხელით არ ჩაასწორე 
# განსხვავება tuple  და list შორის tuple შესაქმნეალდ ვიყენებთ ფრჩხილებს და list შესაქმნელად ვიყენებთ ოთხუთხედ ფრჩილებს
list1000000 = ["N", "I", "what are you thinking about" , "K", "O", "R", "A"]
list1000000.pop(2)
list1000000.pop(2)
list1000000.pop(2)
list1000000.pop(2)
list1000000.pop(2)

list1000000.append("G")
list1000000.append("A")
print(list1000000)

# set  ში შეგვიძლია შევინახოთ 2 ან მეტი მნიშვნელობა
# შეგვიძლია შევცვალოთ ჩავამატოთ და ამოვშალოთ რაღაცეები
# ასევე setში რადომად გამოქვს მოცემული stirnegi და ა.შ
# 
